### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
data_all_df = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
data_all_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
schools_count = len(data_all_df["school_name"].unique())
schools_count

15

In [3]:
students_count = data_all_df["student_name"].count()
students_count

39170

In [4]:
budget = data_all_df["budget"].sum()
budget

82932329558

In [5]:
math_avg = data_all_df["math_score"].mean()
math_avg

78.98537145774827

In [6]:
reading_avg = data_all_df["reading_score"].mean()
reading_avg

81.87784018381414

In [7]:
overall_avg = (math_avg + reading_avg) / 2
overall_avg

80.43160582078121

In [8]:
math_pass_percent = len(data_all_df.loc[data_all_df["math_score"] >= 70]) / students_count * 100
math_pass_percent

74.9808526933878

In [9]:
reading_pass_percent = len(data_all_df.loc[data_all_df["reading_score"] >= 70]) / students_count * 100
reading_pass_percent

85.80546336482001

In [10]:
district_summary = [{"# Schools": schools_count, "# Students": students_count, "Budget $": budget, 
            "Average Math Score": math_avg, "Average Reading Score": reading_avg, "Overall Average Score": overall_avg, 
            "% Pass - Math": math_pass_percent, "% Pass - Reading": reading_pass_percent}]

district_summary_df = pd.DataFrame(district_summary)
district_summary_df = district_summary_df[["# Schools", "# Students", "Budget $", "Average Math Score", "Average Reading Score",
                                       "Overall Average Score", "% Pass - Math", "% Pass - Reading"]]
district_summary_df = district_summary_df.round(1)
district_summary_df

,# Schools,# Students,Budget $,Average Math Score,Average Reading Score,Overall Average Score,% Pass - Math,% Pass - Reading
0,15,39170,82932329558,79.0,81.9,80.4,75.0,85.8

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [11]:
data_all_df.head(1)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635

In [12]:
group_schools = data_all_df.groupby(['school_name', 'type'])
student_count = group_schools['student_name']
student_count_df = pd.DataFrame((student_count).count())
student_count_df.head(2)

                              student_name
school_name         type
Bailey High School  District          4976
Cabrera High School Charter           1858

In [13]:
budget_df = pd.DataFrame(group_schools['budget'].sum())
budget_df["Per Student Budget ($)"] = budget_df['budget'] / student_count_df['student_name']
budget_df.head(2)

                                   budget  Per Student Budget ($)
school_name         type
Bailey High School  District  15549641728               3124928.0
Cabrera High School Charter    2009159448               1081356.0

In [14]:
avg_scores_df = group_schools['math_score', 'reading_score'].mean()
avg_scores_df.head(2)

                              math_score  reading_score
school_name         type
Bailey High School  District   77.048432      81.033963
Cabrera High School Charter    83.061895      83.975780

In [15]:
math_pass_data_df = data_all_df.loc[data_all_df["math_score"] >= 70, :]
reading_pass_data_df = data_all_df.loc[data_all_df["reading_score"] >= 70, :]
reading_pass_data_df.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635

In [16]:
math_pass_group_schools = math_pass_data_df.groupby(['school_name', 'type'])
math_pass_student_count_df = pd.DataFrame(math_pass_group_schools['student_name'].count())
math_pass_student_count_df["Passed Math (%)"] = math_pass_student_count_df['student_name'] / student_count_df['student_name'] * 100
math_pass_percent_df = pd.DataFrame(math_pass_student_count_df["Passed Math (%)"])
math_pass_percent_df.head(2)

                              Passed Math (%)
school_name         type
Bailey High School  District        66.680064
Cabrera High School Charter         94.133477

In [17]:
reading_pass_group_schools = reading_pass_data_df.groupby(['school_name', 'type'])
reading_pass_student_count_df = pd.DataFrame(reading_pass_group_schools['student_name'].count())
reading_pass_student_count_df["Passed Reading (%)"] = reading_pass_student_count_df['student_name'] / student_count_df['student_name'] * 100
reading_pass_percent_df = pd.DataFrame(reading_pass_student_count_df["Passed Reading (%)"])
reading_pass_percent_df.head(2)

                              Passed Reading (%)
school_name         type
Bailey High School  District           81.933280
Cabrera High School Charter            97.039828

In [18]:
passing_df = pd.merge(math_pass_percent_df, reading_pass_percent_df, how="left", on=["school_name", "type"])
passing_df["Overall Pass (%)"] = (passing_df["Passed Math (%)"] + passing_df["Passed Reading (%)"]) / 2
passing_df.head(2)

,,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,
Bailey High School,District,66.680064,81.933280,74.306672
Cabrera High School,Charter,94.133477,97.039828,95.586652

In [19]:
school_df = pd.merge(student_count_df, budget_df, how="left", on=["school_name", "type"])
school_df = pd.merge(school_df, avg_scores_df, how="left", on=["school_name", "type"])
school_df = pd.merge(school_df, passing_df, how="left", on=["school_name", "type"])
school_df = school_df.rename(columns={"student_name": "# of Students", "budget": "Budget ($)"})
school_df = school_df.round(1)
school_df.head()

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,,,,,,
Bailey High School,District,4976,15549641728,3124928.0,77.0,81.0,66.7,81.9,74.3
Cabrera High School,Charter,1858,2009159448,1081356.0,83.1,84.0,94.1,97.0,95.6
Figueroa High School,District,2949,5557128039,1884411.0,76.7,81.2,66.0,80.7,73.4
Ford High School,District,2739,4831365924,1763916.0,77.1,80.7,68.3,79.3,73.8
Griffin High School,Charter,1468,1346890000,917500.0,83.4,83.8,93.4,97.1,95.3

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [20]:
school_sorted_df = school_df.sort_values("Overall Pass (%)", ascending=False)
school_sorted_df.head()

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,,,,,,
Cabrera High School,Charter,1858,2009159448,1081356.0,83.1,84.0,94.1,97.0,95.6
Griffin High School,Charter,1468,1346890000,917500.0,83.4,83.8,93.4,97.1,95.3
Pena High School,Charter,962,563595396,585858.0,83.8,84.0,94.6,95.9,95.3
Thomas High School,Charter,1635,1705517550,1043130.0,83.4,83.8,93.3,97.3,95.3
Wilson High School,Charter,2283,3012587442,1319574.0,83.3,84.0,93.9,96.5,95.2

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

In [21]:
school_sorted_ascending_df = school_df.sort_values("Overall Pass (%)", ascending=True)
school_sorted_ascending_df.head()

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,,,,,,
Rodriguez High School,District,3999,10186904637,2547363.0,76.8,80.7,66.4,80.2,73.3
Figueroa High School,District,2949,5557128039,1884411.0,76.7,81.2,66.0,80.7,73.4
Huang High School,District,2917,5573322295,1910635.0,76.6,81.2,65.7,81.3,73.5
Johnson High School,District,4761,14733628650,3094650.0,77.1,81.0,66.1,81.2,73.6
Ford High School,District,2739,4831365924,1763916.0,77.1,80.7,68.3,79.3,73.8

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [22]:
math_scores = data_all_df.groupby(['school_name', 'grade'])
math_scores_avg_df = pd.DataFrame(math_scores['math_score'].mean())
math_scores_avg_df = math_scores_avg_df.round(1)
math_scores_avg_df = math_scores_avg_df.rename(columns={"math_score": "Average Math Score"})
math_scores_avg_df.head(8)

                           Average Math Score
school_name         grade
Bailey High School  10th                 77.0
                    11th                 77.5
                    12th                 76.5
                    9th                  77.1
Cabrera High School 10th                 83.2
                    11th                 82.8
                    12th                 83.3
                    9th                  83.1

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [23]:
reading_scores = data_all_df.groupby(['school_name', 'grade'])
reading_scores_avg_df = pd.DataFrame(reading_scores['reading_score'].mean())
reading_scores_avg_df = reading_scores_avg_df.round(1)
reading_scores_avg_df = reading_scores_avg_df.rename(columns={"reading_score": "Average Reading Score"})
reading_scores_avg_df.head(8)

                           Average Reading Score
school_name         grade
Bailey High School  10th                    80.9
                    11th                    80.9
                    12th                    80.9
                    9th                     81.3
Cabrera High School 10th                    84.3
                    11th                    83.8
                    12th                    84.3
                    9th                     83.7

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [24]:
school_df = school_df.sort_values("Per Student Budget ($)", ascending=True)
school_df.head(1)

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,,,,,,
Holden High School,Charter,427,105933149,248087.0,83.8,83.8,92.5,96.3,94.4

In [25]:
school_df.tail(1)

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%)
school_name,type,,,,,,,,
Bailey High School,District,4976,15549641728,3124928.0,77.0,81.0,66.7,81.9,74.3

In [26]:
spending_bins = [0, 600000, 1200000, 1800000, 2400000, 3200000]
group_names = ["V. Low (<600K)", "Low (600K - 1.2M)", "Medium (1.2M - 1.8M)", "High (1.8M - 2.4M)", "V. High (>2.4M)"]

In [27]:
school_df["Spending Bin"] = pd.cut(school_df["Per Student Budget ($)"], spending_bins, labels=group_names, right=False)
school_df.head(2)

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%),Spending Bin
school_name,type,,,,,,,,,
Holden High School,Charter,427,105933149,248087.0,83.8,83.8,92.5,96.3,94.4,V. Low (<600K)
Pena High School,Charter,962,563595396,585858.0,83.8,84.0,94.6,95.9,95.3,V. Low (<600K)

In [28]:
school1_df = school_df.groupby("Spending Bin")
school1_df["Spending Bin"].count()

Spending Bin
V. Low (<600K)          2
Low (600K - 1.2M)       5
Medium (1.2M - 1.8M)    2
High (1.8M - 2.4M)      2
V. High (>2.4M)         4
Name: Spending Bin, dtype: int64

## Scores by School Size

* Perform the same operations as above, based on school size.

In [29]:
student_count_df.sort_values("student_name")

                                student_name
school_name           type
Holden High School    Charter            427
Pena High School      Charter            962
Griffin High School   Charter           1468
Thomas High School    Charter           1635
Shelton High School   Charter           1761
Wright High School    Charter           1800
Cabrera High School   Charter           1858
Wilson High School    Charter           2283
Ford High School      District          2739
Huang High School     District          2917
Figueroa High School  District          2949
Rodriguez High School District          3999
Hernandez High School District          4635
Johnson High School   District          4761
Bailey High School    District          4976

In [30]:
size_bins = [0, 1000, 2000, 3000, 4000, 5000]
group_names = ["Tiny", "Small", "Medium", "Large", "Huge"]

In [31]:
school_df["School Size Bin"] = pd.cut(school_df["# of Students"], size_bins, labels=group_names, right=False)
school_df.head(2)

,,# of Students,Budget ($),Per Student Budget ($),math_score,reading_score,Passed Math (%),Passed Reading (%),Overall Pass (%),Spending Bin,School Size Bin
school_name,type,,,,,,,,,,
Holden High School,Charter,427,105933149,248087.0,83.8,83.8,92.5,96.3,94.4,V. Low (<600K),Tiny
Pena High School,Charter,962,563595396,585858.0,83.8,84.0,94.6,95.9,95.3,V. Low (<600K),Tiny

In [32]:
school2_df = school_df.groupby("School Size Bin")
school2_df["School Size Bin"].count()

School Size Bin
Tiny      2
Small     5
Medium    4
Large     1
Huge      3
Name: School Size Bin, dtype: int64

## Scores by School Type

* Perform the same operations as above, based on school type.

In [33]:
# Unless I'm misunderstanding the question, this is already done.
## Both the spending-bin and school-size-bin tables already include scores by school-type (Charter or District).